import { Lunar } from "lunar-typescript"
import CG from "console-grid"

// 六宫序列
const sixPalaces = ["大安", "流连", "速喜", "赤口", "小吉", "空亡"]

// 时辰对应的数字
const timeMap = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"]

const palaces = {
  大安: {
    属性: {
      五行: "木",
      颜色: "青色",
      方位: "东方",
      神兽: "青龙",
      时辰: [1, 5, 7],
      含义: "有静止、心安、吉祥之含义",
    },
    单宫断事: [
      "大安事事昌，求财在坤方，失物去不远，宅舍保安康，行人身未动，病者主无妨。",
      "将军回田野，仔细与推详，丢失在附近，可能西南向，安居得吉日，不可动身祥。",
      "办事别出屋，求借邀自房，得病凶化吉，久疾得安康，寻人知音信，可能归村庄。",
      "口舌能消散，远行要提防，交易别出村，离屯细推详，求财有八分，得全不出房。",
    ],
    双宫断事: {
      流连: "办事不周全，失物西北去，婚姻晚几天。",
      速喜: "办事自己起，失物当天见，婚姻自己提。",
      赤口: "办事不顺手，失物不用找，婚姻两分手。",
      小吉: "事事从己及，失物不出门，婚姻成就地。",
      空亡: "病人要上床，失物无踪影，事事不顺情。",
    },
  },
  流连: {
    属性: {
      五行: "水",
      颜色: "黑色",
      方位: "北方",
      神兽: "玄武",
      时辰: [2, 8, 10],
      含义: "有喑味不明，延迟、纠缠、拖延、漫长之含义",
    },
    单宫断事: [
      "留连事未当，求事日莫光，凡事只宜缓，去者未迴向，失物南方去，急急行便访。",
      "紧记防口舌，人口且平祥，丢失难寻找，窃者又转场，出行定不归，久去拖延长。",
      "办事不果断，牵连又返往，求借不易成，被求而徬徨，此日患疾病，几天不复康。",
      "找人迷雾中，迷迷又恍惚，口舌继续有，拖拉又伸长，女方嫁吉日，求财六分量。",
    ],
    双宫断事: {
      大安: "办事两分张，婚姻有喜事，先苦后来甜。",
      速喜: "事事由自己，婚姻有诚意，失物三天里。",
      赤口: "病者死人口，失物准丢失，婚姻两分手。",
      小吉: "事事不用提，失物东南去，病者出人齐。",
      空亡: "病人准死亡，失物不见面，婚姻分两张。",
    },
  },
  速喜: {
    属性: {
      五行: "火",
      颜色: "红色",
      方位: "南方",
      神兽: "朱雀",
      时辰: [3, 6, 9],
      含义: "有快速、喜庆、吉利之含义，指时机已到",
    },
    单宫断事: [
      "速喜喜临乡，求财往南方，失物申午未，逢人路寻详。",
      "官事有福德，病者无大伤，六畜田稼庆，行人有音向。",
      "丢失得音信，微乐在面上，出行遇吉利，小喜而顺当。",
      "办事如逢春，吉利又荣光，小量可求借，大事难全强。",
      "久病见小愈，得病速回康，寻人得知见，口舌见消亡。",
      "交易可得成，但不太久长，求财有十分，吉时得顺当。",
    ],
    双宫断事: {
      赤口: "自己往外走，失物去正北，婚姻得勤走。",
      小吉: "婚姻有人提，病人当天好，失物在家里。",
      空亡: "婚姻有分张，病人积极治，失物不久见。",
      大安: "事事都平安，婚姻成全了，占病都相安。",
      流连: "婚姻不可言，失物无信息，病人有仙缘。",
    },
  },
  赤口: {
    属性: {
      五行: "金",
      颜色: "白色",
      方位: "西方",
      神兽: "白虎",
      时辰: [4, 7, 10],
      含义: "有不吉、惊恐、凶险、口舌是非之含义",
    },
    单宫断事: [
      "赤口主口伤，官事且紧防，失物急去找，行人有惊慌。",
      "鸡犬多作怪，病者上西方。更须防咒咀，恐怕染瘟殃。",
      "找物犯谎口，询问无音向，出门千口怨，言谈万骂伤。",
      "办事犯口舌，难成有阻挡，求借不全顺，闭口无事张。",
      "得病千口猜，求医还无妨。寻人得凶音，人心不安详。",
      "口舌犯最重，交易口舌防，求财只四分，逢吉才成当。",
    ],
    双宫断事: {
      小吉: "办事自己提，婚姻不能成，失物无信息。",
      空亡: "无病也上床，失物不用找，婚姻不能成。",
      大安: "办事险和难，失物东北找，婚姻指定难。",
      流连: "办事有困难，行人往外走，失物不回还。",
      速喜: "婚姻在自己，失物有着落，办事官事起。",
    },
  },
  小吉: {
    属性: {
      五行: "木",
      神兽: "六合",
      时辰: [1, 5, 7],
      含义: "有和合、吉利之含义",
    },
    单宫断事: [
      "小吉最吉昌，路上好商量，阴人来报喜，失物在坤方。",
      "行人立刻至，交易甚是强，凡事皆合好，病者保安康。",
      "大吉又大顺，万事如意详，出行可得喜，千里吉安详。",
      "诸事可心顺，有忧皆消光，求借自来助，众友愿相帮。",
      "重病莫要愁，久病得安康。不见得相见，不打自归庄。",
      "千人称赞君，无限上荣光，交易成兴隆，十二分财量。",
    ],
    双宫断事: {
      空亡: "病人不妥当，失物正东找，婚姻再想想。",
      大安: "事事两周全，婚姻当日定，失物自己损。",
      流连: "事事有返还，婚姻有人破，失物上西南。",
      速喜: "事事从头起，婚姻能成就，失物在院里。",
      赤口: "办事往外走，婚姻有难处，失物丢了手。",
    },
  },
  空亡: {
    属性: {
      五行: "土",
      颜色: "黄色",
      方位: "中央",
      神兽: "勾陈",
      时辰: [3, 6, 9],
      含义: "有不吉、无结果、忧虑之含义",
    },
    单宫断事: [
      "空亡事不长，阴人无主张，求财心白费，行人有灾殃。",
      "失物永不见，官事有刑伤，病人遇邪鬼，久病添祸殃。",
      "失物难找见，找寻空荡荡，出行不吉利，凶多不吉祥。",
      "办事凶为多，处处有阻挡，求借不能成，成事化败伤。",
      "得病凶多噩，久霜，寻人无音信，知音变空想。",
      "万口都诽谤，小舟遭狂浪，求财有二分，不吉不利亡。",
    ],
    双宫断事: {
      大安: "事事不周全，婚姻从和好，失物反复间。",
      流连: "办事处处难，婚姻重新定，失物永不还。",
      速喜: "事事怨自己，婚姻有一定，失物在家里。",
      赤口: "办事官非有，婚姻难定准，失物往远走。",
      小吉: "事事有猜疑，婚姻有喜事，失物在家里。",
    },
  },
}

// 通过农历月、日、时来推导宫位
function calculateSixPalace(lunarMonth, lunarDay, timeName) {
  const time = timeMap.findIndex((name) => name === timeName) + 1 // 将时辰名称映射为数字

  // Step 1: 月上起日，从大安起顺时针数月数格
  const monthPalaceIndex = (lunarMonth - 1) % 6
  const monthPalace = sixPalaces[monthPalaceIndex]

  // Step 2: 日上起时，从月宫起顺时针数日数格
  const dayPalaceIndex = monthPalaceIndex - 1 + (lunarDay % 6)

  const dayPalace = sixPalaces[dayPalaceIndex % 6]

  // Step 3: 时上起宫，从日宫起顺时针数时数格
  const timePalaceIndex = dayPalaceIndex - 1 + (time % 6)
  const timePalace = sixPalaces[timePalaceIndex % 6]

  // 返回单宫和双宫占卦结果
  return {
    dayPalace,
    timePalace,
  }
}

// 输入阳历日期和时辰
function predictBySolarDate(time) {
  const date = new Date(time)
  const lunar = Lunar.fromDate(date) // 将阳历转为农历
  const lunarMonth = lunar.getMonth() // 农历时辰
  const lunarDay = lunar.getDay() // 农历时辰
  const lunarTime = lunar.getTimeZhi() // 农历时辰

  // 根据农历月份和日期进行占卜
  const result = calculateSixPalace(lunarMonth, lunarDay, lunarTime)

  // 输出结果
  console.log(`${time} 为农历：${lunar.getMonthInChinese()}月${lunar.getDayInChinese()}日${lunarTime}时`)
  console.log(`单宫断事结果：${result.timePalace}\n${palaces[result.timePalace]["单宫断事"].join("\n")}`)
  console.log(
    `双宫断事结果：${result.dayPalace} + ${result.timePalace}\n${
      palaces[result.dayPalace]["双宫断事"][result.timePalace] || "日时相同，参照单宫断事"
    }`
  )
  const data = {
    options: {
      padding: 2,
    },
    columns: ["时辰", "时间", "六神", "吉凶", "当下"],
    rows: timeMap.reduce((acc, timeName, index) => {
      const obj = { 时辰: timeName }
      const { timePalace } = calculateSixPalace(lunarMonth, lunarDay, timeName)
      obj["时间"] = `${(23 + index * 2) % 24}点-${(1 + index * 2) % 24}点`
      obj["六神"] = timePalace
      obj["吉凶"] = ["大安", "速喜", "小吉"].includes(timePalace) ? "吉" : "凶"
      obj["当前时间"] = timeName === lunarTime ? "✔" : ""
      acc.push([obj.时辰, obj.时间, obj.六神, obj.吉凶, obj.当前时间])
      return acc
    }, []),
  }
  CG(data)
}

// "2021-10-07 12:00:00"
predictBySolarDate(new Date())
